# Таблица 8.1. Литералы списков и операции. page 255

l=[] # Пустой список
l=[0,1,2,3] # Четыре элемента с индексами 0..3
l=["abc", ["def","ghi"]] # Вложенные списки
l=list("spam") # Создание списка из итерируемого объекта.
l=list(range(-4,4)) # [-4, -3, -2, -1, 0, 1, 2, 3] - Создание списка из непрерывной последовательности целых чисел
len(l) # количество элементов в списке
l*3 # [-4, -3, -2, -1, 0, 1, 2, 3, -4, -3, -2, -1, 0, 1, 2, 3, -4, -3, -2, -1, 0, 1, 2, 3]
for i in l: print(i) # Обход в цикле, проверка вхождения
# l=l.append(4) # Методы: добавление элементов в списо
l.append(4)
l.extend([5,6,7])
# l.insert(8, 9)
l.index(1) # Методы: поиск
#l.count()
#l.sort() # Методы: сортировка, изменение порядка следования элементов на обратный
l.reverse()
#l.pop()
#l.remove(2)
l=[i**2 for i in range(5)] # Генераторы списков и отображение
print(l)
#print(map(ord,"spam"))


# Базовые операции над списками. page 256

[1,2,3]+[4,5,6] # [1, 2, 3, 4, 5, 6]
["Ni!"]*4 # [‘Ni!’, ‘Ni!’, ‘Ni!’, ‘Ni!’]
str([1,2])+"34" # То же, что и “[1, 2]” + “34”
print([1,2]+list("34"))
